script.yml
# Full documentation of Artillery at:
# https://artillery.io/docs/
---
config:
  target: "https://spoke-fly.edgeapp.net"
  phases:
    - duration: 10
      arrivalRate: 3

scenarios:
  - flow:
    # https://artillery.io/docs/http-reference/#looping-through-an-array
      - over:
          - "session=eyJwYXNzcG9ydCI6eyJ1c2VyIjoiYXV0aDB8NWM0ZTI4NjdkZWQzYjcwM2Y3ZTY3OTI5In19; session.sig=enEqYHLHs99AztkMJbhAx017R-Y"
        loop:
          - post:
            url: "/graphql"
            cookie: "session=eyJwYXNzcG9ydCI6eyJ1c2VyIjoiYXV0aDB8NWM0ZTI4NjdkZWQzYjcwM2Y3ZTY3OTI5In19; session.sig=enEqYHLHs99AztkMJbhAx017R-Y" # {{ $loopElement }}
              # session: "SET_ME"
              # session.sig: "SET_ME"
            body: >
              {"query":"query getTodos($organizationId: String!, $needsMessageFilter: ContactsFilter, $needsResponseFilter: ContactsFilter, $badTimezoneFilter: ContactsFilter, $completedConvosFilter: ContactsFilter, $pastMessagesFilter: ContactsFilter, $skippedMessagesFilter: ContactsFilter) {\n  currentUser {\n    id\n    terms\n    todos(organizationId: $organizationId) {\n      id\n      campaign {\n        id\n        title\n        description\n        useDynamicAssignment\n        hasUnassignedContacts\n        introHtml\n        primaryColor\n        logoImageUrl\n      }\n      maxContacts\n      unmessagedCount: contactsCount(contactsFilter: $needsMessageFilter)\n      unrepliedCount: contactsCount(contactsFilter: $needsResponseFilter)\n      badTimezoneCount: contactsCount(contactsFilter: $badTimezoneFilter)\n      totalMessagedCount: contactsCount(contactsFilter: $completedConvosFilter)\n      pastMessagesCount: contactsCount(contactsFilter: $pastMessagesFilter)\n      skippedMessagesCount: contactsCount(contactsFilter: $skippedMessagesFilter)\n    }\n  }\n}\n","variables":{"organizationId":"1","needsMessageFilter":{"messageStatus":"needsMessage","isOptedOut":false,"validTimezone":true},"needsResponseFilter":{"messageStatus":"needsResponse","isOptedOut":false,"validTimezone":true},"badTimezoneFilter":{"isOptedOut":false,"validTimezone":false},"completedConvosFilter":{"isOptedOut":false,"validTimezone":true,"messageStatus":"messaged"},"pastMessagesFilter":{"messageStatus":"convo","isOptedOut":false,"validTimezone":true},"skippedMessagesFilter":{"messageStatus":"closed","isOptedOut":false,"validTimezone":true}},"operationName":"getTodos"}
            capture:
              json: /data/___getTodos___requestIndex_1___fieldIndex_0/todos[1]/campaign/id
              as: "assignmentId"
          - log: " Got campaign id {{ assignmentId }}"
          # - post:
          #   url: "/graphql"
          #   cookie:
          #     session: {{ $loopElement }}
          #   body: |
          #     {
          #       "query": ""
          #     }